#if defined(__XCWS__)
#ifndef _TRACK_CUST_PAKET_H
#define _TRACK_CUST_PAKET_H

/****************************************************************************
*  Include Files                        包含头文件
*****************************************************************************/
#include "track_drv_gps_decode.h"
#include "track_drv_lbs_data.h"

/*****************************************************************************
*  Define                               宏定义
******************************************************************************/

/*****************************************************************************
*  Typedef  Enum                        枚举定义
*****************************************************************************/
typedef enum
{
    TR_CUST_POSITION_TIMING       = 0,   //定时上报
    TR_CUST_POSITION_DISTANCE     = 1,   //定距上报
    TR_CUST_POSITION_ANGLEREP     = 2,   //拐点上传
    TR_CUST_POSITION_ACC_CHANGE   = 3,   //ACC 状态改变上传
    TR_CUST_POSITION_STATIC       = 4,   //从运动变为静止状态后，补传最后一个定位点
    TR_CUST_POSITION_RECONNECT    = 5,   //网络断开重连后，上报之前最后一个有效上传点
    TR_CUST_POSITION_MAX
} enum_CUST_POSITION_type;

/*****************************************************************************
*  Struct                               数据结构定义
******************************************************************************/
/*typedef struct
{
    track_gps_data_struct *gd;
    LBS_Multi_Cell_Data_Struct *lbs;
    kal_uint16 status;
    kal_uint8 GSMSignalStrength;
    float battery;
} track_cust_packet_params_struct;*/
/****************************************************************************
*  Global Variable - Extern             引用全局变量
*****************************************************************************/

/*****************************************************************************
*  Global Functions - Extern            引用外部函数
******************************************************************************/

/*****************************************************************************
*  Local Functions Define               本地函数声明
******************************************************************************/
extern void gprs_login_data_send(void);
#endif  /* _TRACK_CUST_PAKET_H */

#endif /* __XCWS__ */
