#ifndef _TRACK_SOC_H
#define _TRACK_SOC_H

/****************************************************************************
*  Include Files                        包含头文件
*****************************************************************************/
#include "soc_api.h"

/*****************************************************************************
*  Define                               宏定义
******************************************************************************/
#if defined(__MQTT__)
#define SOC_SOCKET_RECEIVE_DATA_MAX       3072  //接收缓冲区最大长度
#else
#define SOC_SOCKET_RECEIVE_DATA_MAX       2048  //接收缓冲区最大长度
#endif
#define SOC_SOCKET_SEND_DATA_MAX          2048  //发送缓冲区最大长度

/*****************************************************************************
*  Typedef  Enum                        枚举定义
*****************************************************************************/

/*****************************************************************************
*  Struct                               数据结构定义
******************************************************************************/

/****************************************************************************
*  Global Variable - Extern             引用全局变量
*****************************************************************************/

/*****************************************************************************
*  Global Functions - Extern            引用外部函数
******************************************************************************/
extern kal_uint16 track_drv_encode_exmode(kal_uint8 head, kal_uint16 packet, kal_uint8 pid, kal_uint8 *data, kal_uint16 len);
//extern kal_uint16 track_cust_upload_position_data_repacket(kal_uint8 head, kal_uint16 packet, kal_uint8 pid, kal_uint8 *data, kal_uint16 len,kal_uint32 nodata,kal_uint8  queue_id,kal_uint8 app);
/*****************************************************************************
*  Local Functions Define               本地函数声明
******************************************************************************/

#endif  /* _TRACK_SOC_H */

