#ifndef _TRACK_OS_PARAMETER_HANDLE_H
#define _TRACK_OS_PARAMETER_HANDLE_H
/******************************************************************************
 *  -
 *
 * Copyright .
 *
 * DESCRIPTION: -
 *
 *
 *
 *
 * modification history
 * --------------------
 *
 ******************************************************************************/

/****************************************************************************
* Include Files             包含头文件
*****************************************************************************/

/*****************************************************************************
*  Define			               宏定义
*****************************************************************************/

/*****************************************************************************
* Typedef  Enum                      枚举
*****************************************************************************/


/*****************************************************************************
 *  Struct			               数据结构定义
*****************************************************************************/
/**
* nvram_alone_parameter的接口集。
*/
typedef struct
{
    /**
    *
    *
    * @param data			
    *
    * @return				0表示成功，其余表示失败
    *
    */
    int (*reset)(void);
    
    /**
    *
    *
    * @param data			apn结构参数
    *
    * @return				0表示成功，其余表示失败
    *
    */
    int (*apn_set)(nvram_GPRS_APN_struct *data);

    /**
    *
    *
    * @param obj
    * @param index
    *
    * @return				0表示成功，其余表示失败
    *
    */
    int (*server_set)(nvram_server_addr_struct *data);

    /**
    *
    *
    * @param obj
    * @param index
    *
    * @return				0表示成功，其余表示失败
    *
    */
    int (*server_ams_set)(nvram_server_addr_struct *data);

    /**
    *
    *
    * @param obj
    * @param index
    *
    * @return				0表示成功，其余表示失败
    *
    */
    int (*gprson_set)(kal_uint8 data);

} nvram_alone_parameter_cmd_struct;


/*****************************************************************************
* Local variable                     局部变量
*****************************************************************************/

/****************************************************************************
* Global Variable                    全局变量
*****************************************************************************/
extern nvram_alone_parameter_cmd_struct nvram_alone_parameter_cmd;

/****************************************************************************
* Global Variable - Extern           引用全局变量
*****************************************************************************/
extern nvram_alone_parameter_struct * track_nvram_alone_parameter_read(void);


/*****************************************************************************
*  Global Functions	- Extern	    引用外部函数
*****************************************************************************/


/*****************************************************************************
*  Local Functions	               本地函数申明
*****************************************************************************/


#endif  /* _TRACK_OS_PARAMETER_HANDLE_H */
